//---------------------------------------------------------------------------
#ifndef VTMalhaH
#define VTMalhaH

//---------------------------------------------------------------------------
#include <Classes.hpp>

//---------------------------------------------------------------------------
class VTRedes;
class VTMRede;

//---------------------------------------------------------------------------
class VTMalha : public TObject
   {
   public:
                       __fastcall VTMalha(void) {};
                       __fastcall ~VTMalha(void) {};
      virtual VTMRede* __fastcall Executa(TList *lisMR) = 0;
   };

//---------------------------------------------------------------------------
//função global p/ criar objeto da classe VTMalha
//---------------------------------------------------------------------------
VTMalha* __fastcall NewObjMalha(void);

//---------------------------------------------------------------------------
#endif
//eof



 