//---------------------------------------------------------------------------
#ifndef Redegraf_H
#define Redegraf_H

//---------------------------------------------------------------------------
#include <Classes.hpp>
#include "Export.h"

//---------------------------------------------------------------------------
class VTApl;
class VTCelulas;
class VTRedegraf;

//-----------------------------------------------------------------------------
// funções da DLL
//-----------------------------------------------------------------------------
EXPORT VTCelulas*  __fastcall DLL_NewObjCelulas(VTApl *apl);
EXPORT VTRedegraf* __fastcall DLL_NewObjRedegraf(VTApl *apl);

#endif
//---------------------------------------------------------------------------
//eof

 